Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если не ЭтотОбъект.ЭтоГруппа Тогда
		Родитель = ЭтотОбъект.Родитель;
		ПустаяСсылка = Справочники.Номенклатура.ПустаяСсылка();
		
		Если Родитель = ПустаяСсылка тогда
			Отказ = Истина;
			Сообщить("Неверная группа");
			Возврат;
		КонецЕсли;	
		
		Если Родитель = Справочники.Номенклатура.Услуги Тогда
			Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				Отказ = Истина;
				Сообщить("Неверная группа");
				Возврат;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.Товары Тогда
			Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				Отказ = Истина;
				Сообщить("Неверная группа");
				Возврат;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.Материалы Тогда
			Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Материал Тогда
				Отказ = Истина;
				Сообщить("Неверная группа");
				Возврат;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыКлиента Тогда
			Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.МатериалКлиента Тогда
				Отказ = Истина;
				Сообщить("Неверная группа");
				Возврат;
			КонецЕсли;				
		КонецЕсли;		
	КонецЕсли; 
	
КонецПроцедуры
